wigleyHull/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-26 -19 -16)   // 0
    (16 -19 -16)    // 1
    (16 0 -16)      // 2
    (-26 0 -16)     // 3

    (-26 -19 -1)    // 4
    (16 -19 -1)     // 5
    (16 0 -1)       // 6
    (-26 0 -1)      // 7

    (-26 -19 0.744) // 8
    (16 -19 0.744)  // 9
    (16 0 0.744)    // 10
    (-26 0 0.744)   // 11

    (-26 -19 0.8) // 12
    (16 -19 0.8)  // 13
    (16 0 0.8)    // 14
    (-26 0 0.8)   // 15

    (-26 -19 0.856)   // 16
    (16 -19 0.856)    // 17
    (16 0 0.856)      // 18
    (-26 0 0.856)     // 19

    (-26 -19 1.6)   // 20
    (16 -19 1.6)    // 21
    (16 0 1.6)      // 22
    (-26 0 1.6)     // 23

    (-26 -19 4)     // 24
    (16 -19 4)      // 25
    (16 0 4)        // 26
    (-26 0 4)       // 27
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (42 19 50) simpleGrading (1 1 0.05)
    hex (4 5 6 7 8 9 10 11) (42 19 75) simpleGrading (1 1 1)
    hex (8 9 10 11 12 13 14 15) (42 19 4) simpleGrading (1 1 1)
    hex (12 13 14 15 16 17 18 19) (42 19 4) simpleGrading (1 1 1)
    hex (16 17 18 19 20 21 22 23) (42 19 25) simpleGrading (1 1 1)
    hex (20 21 22 23 24 25 26 27) (42 19 20) simpleGrading (1 1 5)
);

edges
(
);

boundary
(
    atmosphere
    {
        type patch;
        faces
        (
            (24 25 26 27)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
            (5 6 10 9)
            (9 10 14 13)
            (13 14 18 17)
            (17 18 22 21)
            (21 22 26 25)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
            (4 8 11 7)
            (8 12 15 11)
            (12 16 19 15)
            (16 20 23 19)
            (20 24 27 23)
        );
    }
    bottom
    {
        type symmetryPlane;
        faces
        (
            (0 3 2 1)
        );
    }
    side
    {
        type symmetryPlane;
        faces
        (
            (0 1 5 4)
            (4 5 9 8)
            (8 9 13 12)
            (12 13 17 16)
            (16 17 21 20)
            (20 21 25 24)
        );
    }
    midPlane
    {
        type symmetryPlane;
        faces
        (
            (3 7 6 2)
            (7 11 10 6)
            (11 15 14 10)
            (15 19 18 14)
            (19 23 22 18)
            (23 27 26 22)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
