wigleyHull/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    c1;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-10 -6 -3) (10 0 3);
        }
    }
    {
        name    c2;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-5 -3 -2.5) (9 0 2.5);
        }
    }
    {
        name    c3;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-3 -2 -1) (8 0 2);
        }
    }
    {
        name    c4;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-2 -1.7 -0.6) (7 0 1.75);
        }
    }
    {
        name    c5;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-1 -1.2 -0.3) (6.5 0 1.5);
        }
    }
    {
        name    c6;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-0.5 -0.7 -0.15) (6.3 0 1.35);
        }
    }
);

// ************************************************************************* //
